**Hello everyone!**

This assignment is based on basics of python and then gradually moves on to the python libraries required for working in ML.

> **Workflow**

Above each cell there are some instructions and resources (wherever necessary) for completing the question. You are supposed to solve the questions in the cells below the question text, feel free to add cells if you want.

> **Note:** All the documentations provided are very extensive and you do not need to know everything but you are expected to be able to refer to them as and when required.

# Copy this notebook in your drive and in submission please rename the file as <name_roll.no_PYTHON>

# Basic Python

If you are absolutely new to python, quickly go through this video: https://www.youtube.com/watch?v=K5KVEU3aaeQ&ab_channel=ProgrammingwithMosh

This will help you brush up your python to get your started.
Please note that things like conditional if else statements, basic string operations, tuples, etc. aren't included separately in this task but you are obviously expected to be familiar with them. *italicised text*

***Print hello world.***

In [1]:
print("hello world")

hello world

***Print the sum of two numbers which the user inputs.***

In [2]:
a=int(input("enter first number"))
b=int(input("enter second number"))
print("the sum of two numbers is",a+b)

enter first number5
enter second number7
the sum of two numbers is 12

***Loops (Logical Thinking)***

Print the following patterns using a loop of your choice:


![pt1.png]()

![pt2.png]()

![pt3.png]()

![pt4.png]()

In [3]:
for i in range(1,6):
  for j in range(1,6):
    print("*",end=" ")
  print()

* * * * *
* * * * *
* * * * *
* * * * *
* * * * *

In [4]:
for i in range(1,6):
  for j in range(1,i+1):
    print(i,end=" ")
  print()

1
2 2
3 3 3
4 4 4 4
5 5 5 5 5

In [5]:
for i in range(1,6):
  for j in range(1,i+1):
    if(i%2==0):
      if(j%2==0):
        print("1",end=" ")
      else:
        print("0",end=" ")
    else:
      if(j%2==0):
        print("0",end=" ")
      else:
        print("1",end=" ")

  print()

1
0 1
1 0 1
0 1 0 1
1 0 1 0 1

In [6]:
sp=0
for i in range(1,6):
  for sp in range(1,i+1):
    print(" ",end=" ")
  for j in range(5,i-1,-1):
    print("*",end=" ")
  for j in range(4,i-1,-1):
    print("*",end =" ")
  print()

  * * * * * * * * *
    * * * * * * *
      * * * * *
        * * *
          *

***Consider a list l = [1,12,43,4,15,26].***


1. Write this list in python code.
2. Append a number to this list.
3. Sort this list in increasing order.
4. Reverse the sorted list.
5. Repeat questions (1-4) using loops and list indexing (Tip: if you can't figure out sorting, don't worry, you may skip it for now, those interested can look up "bubble sort" to get a hint).

In [7]:
l=[1,12,43,4,15,26]
l.append(50)
l.sort()
l.reverse()
print(l[0])

50

***Functions***

(Tip: Before starting this section, brush up on strings in python)

Write a function defintion that:
1. Adds the string "Hello, " to the beginning and "!" to the end of any given input.
2. Takes in two numbers, squares each number, then returns the sum of both squares.
3. Takes in value and returns the count of the nubmer of vowels in a sequence.
4. Takes in string and returns the string without any vowels.
5. Takes in a list of strings and returns the shortest string in the list.
6. Takes in sequence of numbers and returns the odd numbers in a list.
7. Takes in sequence of numbers and returns all the numbers added together.

In [8]:
def concat(a,b):
  c=a+b
  return c
print(concat("hello","!"))

hello!

In [9]:
def SumOfSquares(a,b):
  c=a*a+b*b
  return c
print(SumOfSquares(2,3))

13

In [10]:
def CountVowel(a):
  vowels="aeiouAEIOU"
  vc=0
  for ch in a:
    if ch in vowels:
      vc+=1
  return vc
print(CountVowel("hello"))

2

In [11]:
def WithoutVowel(a):
  vowels="aeiouAEIOU"
  newstr=""
  for ch in a:
    if ch not in vowels:
      newstr+=ch
  return newstr
print(WithoutVowel("hello"))

hll

In [12]:
def ShortestString(s):
  shortest=len(s[0])
  for i in s:
    if len(i)<shortest:
      shortest=len(i)
  return shortest
print(ShortestString(["hello","hey","hi"]))

2

In [14]:
def oddlist(l):
  ll=[]
  for i in l:
    if i%2!=0:
      ll.append(i)
  return ll
print(oddlist([1,2,3,4,5]))

[1, 3, 5]

In [13]:
def AddList(l):
  sum=0
  for i in l:
    sum+=i
  return sum
print(AddList([1,2,3,4]))

10

***Sets***

(Read up on sets in python)

Write a function definition that:
1. Takes in a list and returns a set with only the unique values from that list.
2. Takes two lists and returns a single set with the values that each list has in common.

(Bonus - Try doing the above questions from scratch using loops)

# Python for ML

**Brief on AI/ML/DL:**

Artifical Intelligence is a very broad term that refers to any method/process which can help a machine perform human like tasks. ML is a subset of AI and DL is a subset of ML.

Three major libraries used very widely for data processing, visualisation and manipulation are: `numpy`,`pandas` and `matplotlib`. As you explore the domains of ML more, you will soon encounter domain specific libraries like `open-cv`, `scikit-learn`, `nltk`, etc. and as you dive into DL,`tensorflow` and `pytorch` would be your best friends!

This next section deals with numpy, pandas and matplotlib

In [ ]:
# ------------------------------------------------ NUMPY ------------------------------------------------
# Documentation: https://numpy.org/doc/stable/reference/index.html#reference
# Hands on tutorial: https://www.w3schools.com/python/numpy/numpy_intro.asp

1. Crate an array of 10 zeros.
2. Create an array of 10 fives.
3. Create a 3x3 matrix with values ranging from 0 to 8
4. Use NumPy to generate a random number between 0 and 1
5. Create an array of 20 linearly spaced points between 0 and 1

In [15]:
import numpy as np
arr_zeros = np.zeros(10)
print(arr_zeros)

[0. 0. 0. 0. 0. 0. 0. 0. 0. 0.]

In [16]:
import numpy as np
arr_fives = np.ones(10)*5
print(arr_fives)

[5. 5. 5. 5. 5. 5. 5. 5. 5. 5.]

In [17]:
import numpy as np
arr_matrix = np.arange(9).reshape(3,3)
print(arr_matrix)

[[0 1 2]
 [3 4 5]
 [6 7 8]]

In [18]:
import numpy as np
rand_num = np.random.rand()
print(rand_num)

0.8377030015733632

In [19]:
import numpy as np
arr_lin = np.linspace(0,1,20)
print(arr_lin)

[0.         0.05263158 0.10526316 0.15789474 0.21052632 0.26315789
 0.31578947 0.36842105 0.42105263 0.47368421 0.52631579 0.57894737
 0.63157895 0.68421053 0.73684211 0.78947368 0.84210526 0.89473684
 0.94736842 1.        ]

Replicate the following outputs:

In [ ]:
# ------------------------------------------------ MATPLOTLIB ------------------------------------------------
# Documentation: https://matplotlib.org/stable/api/pyplot_summary.html
# Hands on tutorial: https://www.w3schools.com/python/matplotlib_pyplot.asp

**Line plotting**

We begin by simply plotting a straight line, you many choose any line of your choice. Generate your own data! (atleast 100 datapoints)

**Matplotlib figures**

We will now deal with matplotlib figure objects and creating axes using them. You are tasked with creating a figure object and adding two set of axes in that figure make sure that they are appropriately placed.

**Now use the list x generated earlier and create two new y lists to plot on the axes you just created.**

**Plots**

Plot the following plots using matplotlib, you many generate your own data or get it from the internet:

1. Histogram
2. Scatter Plot
3. Boxplot
4. Pie charts

(Bonus - Read up on the use-case of histograms in EDA and ML in general, they are VERY useful! Also, look up **Violin plots** if you have extra time)

In [ ]:
# your solution here

In [ ]:
# ------------------------------------------------ PANDAS ------------------------------------------------
# Documentation: https://pandas.pydata.org/docs/reference/index.html
# Hands on tutorial: https://www.w3schools.com/python/pandas/pandas_intro.asp
# You will need a csv file for this part of the assignment, download it here: https://www.kaggle.com/datasets/shibumohapatra/house-price

**Perform the following operations on the csv file:**

1. Read the csv into a pandas dataframe and back it up (you will thank yourself for doing this when you mess up something while manipulating the dataframe).
2. Explore the dataframe (find out the different ways you can do this).
3. Play around with each column of the dataframe and figure out ways to modify them according to your needs.
4. Read up on ``iloc`` and demonstrate it on the dataframe.
5. Handle ``null`` values in the dataframe.
6. Try dropping rows/columns.
7. Filter rows where a string column starts with a specific letter.
8. Create a new column as a combination of two existing columns (this is feature engineering which you may use in your ML journey).

In [29]:
csv_text = """id,first_name,last_name,age,salary,city,department
1,navya,agarwal,19,50000,Bareilly,HR
2,moksh,bhatt,18,62000,Bharuch,Engineering
3,tamanna,gupta,,58000,Noida,Marketing
4,anshika,agarwal,19,,Lucknow,Finance
5,rishu,prakas,23,54000,bihar,Engineering
6,nitin,agarwal,43,30000,Chandausi,Intern
7,sugandh,goel,40,70000,gurgoan,HR
8,uma,goel,64,68000,surat,Operations
9,surya,prakash,,47000,kanpur,Marketing
10,swati,chaudary,37,60000,delhi,Finance
"""

with open("employees.csv", "w") as f:
    f.write(csv_text)

import pandas as pd

# 1. Read the CSV into a pandas dataframe
df = pd.read_csv("employees.csv")
df_backup = df.copy()

print("=== Original DataFrame ===")
print(df)
print("\n")

# 2. Explore the dataframe in different ways

print("First 5 rows (head)")
print(df.head())
print("\n")

print(" Last 5 rows (tail) ")
print(df.tail())
print("\n")

print(" Shape of the DataFrame (rows, columns) ")
print(df.shape)
print("\n")

print(" Column names ")
print(df.columns)
print("\n")

print(" Data types of each column ")
print(df.dtypes)
print("\n")

print(" Info about DataFrame ")
print(df.info())
print("\n")

print(" Summary statistics for numeric columns ")
print(df.describe())
print("\n")

# 3. Play around with each column

print(" Age column")
print(df["age"])
print("\n")

df["age_plus_5"] = df["age"] + 5
print("New column: age_plus_5 ")
print(df[["age", "age_plus_5"]])
print("\n")

print("Salary column ")
print(df["salary"])
print("\n")

df["salary_k"] = df["salary"] / 1000
print(" New column: salary_k ")
print(df[["salary", "salary_k"]])
print("\n")

print(" First names ")
print(df["first_name"])
print("\n")

df["first_name_upper"] = df["first_name"].str.upper()
print(" New column: first_name_upper ")
print(df[["first_name", "first_name_upper"]])
print("\n")

df["city_length"] = df["city"].str.len()
print("New column: city_length ")
print(df[["city", "city_length"]])
print("\n")

# 4. Using iloc (position-based indexing)

print("Using iloc examples ")

print("First row (df.iloc[0]):")
print(df.iloc[0])
print("\n")

print("First 3 rows (df.iloc[0:3]):")
print(df.iloc[0:3])
print("\n")

print("First row, first column (df.iloc[0, 0]):")
print(df.iloc[0, 0])
print("\n")

print("First 5 rows, first 2 columns (df.iloc[0:5, 0:2]):")
print(df.iloc[0:5, 0:2])
print("\n")

print("All rows, second column (df.iloc[:, 1]):")
print(df.iloc[:, 1])
print("\n")

print("Last row (df.iloc[-1]):")
print(df.iloc[-1])
print("\n")

# 5. Handle null values

print("=== Check for null values in each column ===")
print(df.isna().sum())
print("\n")

mean_age = df["age"].mean()
print("Mean age (ignoring NaN):", mean_age)
df["age_filled"] = df["age"].fillna(mean_age)
print(" Age and age_filled columns ")
print(df[["age", "age_filled"]])
print("\n")

df["salary_filled"] = df["salary"].fillna(0)
print(" Salary and salary_filled columns ")
print(df[["salary", "salary_filled"]])
print("\n")

# 6. Try dropping rows/columns

df_dropped_column = df.drop(columns=["city_length"])
print(" DataFrame after dropping 'city_length' column")
print(df_dropped_column.head())
print("\n")

df_dropped_row = df.drop(index=0)
print(" DataFrame after dropping row with index 0 ")
print(df_dropped_row.head())
print("\n")

# 7. Filter rows where a string column starts with a specific letter

filtered_A = df[df["first_name"].str.startswith("A")]
print("=== Rows where first_name starts with 'A' ===")
print(filtered_A)
print("\n")

filtered_J = df[df["first_name"].str.startswith("J")]
print("=== Rows where first_name starts with 'J' ===")
print(filtered_J)
print("\n")

# 8. Create a new column as a combination of two existing columns

df["full_name"] = df["first_name"] + " " + df["last_name"]
print("=== New column: full_name ===")
print(df[["first_name", "last_name", "full_name"]])
print("\n")

df["city_department"] = df["city"] + " - " + df["department"]
print("=== New column: city_department ===")
print(df[["city", "department", "city_department"]])
print("\n")

print("=== Final DataFrame with new columns ===")
print(df.head())

=== Original DataFrame ===
   id first_name last_name   age   salary       city   department
0   1      navya   agarwal  19.0  50000.0   Bareilly           HR
1   2      moksh     bhatt  18.0  62000.0    Bharuch  Engineering
2   3    tamanna     gupta   NaN  58000.0      Noida    Marketing
3   4    anshika   agarwal  19.0      NaN    Lucknow      Finance
4   5      rishu    prakas  23.0  54000.0      bihar  Engineering
5   6      nitin   agarwal  43.0  30000.0  Chandausi       Intern
6   7    sugandh      goel  40.0  70000.0    gurgoan           HR
7   8        uma      goel  64.0  68000.0      surat   Operations
8   9      surya   prakash   NaN  47000.0     kanpur    Marketing
9  10      swati  chaudary  37.0  60000.0      delhi      Finance


First 5 rows (head)
   id first_name last_name   age   salary      city   department
0   1      navya   agarwal  19.0  50000.0  Bareilly           HR
1   2      moksh     bhatt  18.0  62000.0   Bharuch  Engineering
2   3    tamanna     gupta   NaN  58000.0     Noida    Marketing
3   4    anshika   agarwal  19.0      NaN   Lucknow      Finance
4   5      rishu    prakas  23.0  54000.0     bihar  Engineering


 Last 5 rows (tail)
   id first_name last_name   age   salary       city  department
5   6      nitin   agarwal  43.0  30000.0  Chandausi      Intern
6   7    sugandh      goel  40.0  70000.0    gurgoan          HR
7   8        uma      goel  64.0  68000.0      surat  Operations
8   9      surya   prakash   NaN  47000.0     kanpur   Marketing
9  10      swati  chaudary  37.0  60000.0      delhi     Finance


 Shape of the DataFrame (rows, columns)
(10, 7)


 Column names
Index(['id', 'first_name', 'last_name', 'age', 'salary', 'city', 'department'], dtype='object')


 Data types of each column
id              int64
first_name     object
last_name      object
age           float64
salary        float64
city           object
department     object
dtype: object


 Info about DataFrame
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   id          10 non-null     int64
 1   first_name  10 non-null     object
 2   last_name   10 non-null     object
 3   age         8 non-null      float64
 4   salary      9 non-null      float64
 5   city        10 non-null     object
 6   department  10 non-null     object
dtypes: float64(2), int64(1), object(4)
memory usage: 692.0+ bytes
None


 Summary statistics for numeric columns
             id        age        salary
count  10.00000   8.000000      9.000000
mean    5.50000  32.875000  55444.444444
std     3.02765  16.225531  12197.449642
min     1.00000  18.000000  30000.000000
25%     3.25000  19.000000  50000.000000
50%     5.50000  30.000000  58000.000000
75%     7.75000  40.750000  62000.000000
max    10.00000  64.000000  70000.000000


 Age column
0    19.0
1    18.0
2     NaN
3    19.0
4    23.0
5    43.0
6    40.0
7    64.0
8     NaN
9    37.0
Name: age, dtype: float64


New column: age_plus_5
    age  age_plus_5
0  19.0        24.0
1  18.0        23.0
2   NaN         NaN
3  19.0        24.0
4  23.0        28.0
5  43.0        48.0
6  40.0        45.0
7  64.0        69.0
8   NaN         NaN
9  37.0        42.0


Salary column
0    50000.0
1    62000.0
2    58000.0
3        NaN
4    54000.0
5    30000.0
6    70000.0
7    68000.0
8    47000.0
9    60000.0
Name: salary, dtype: float64


 New column: salary_k
    salary  salary_k
0  50000.0      50.0
1  62000.0      62.0
2  58000.0      58.0
3      NaN       NaN
4  54000.0      54.0
5  30000.0      30.0
6  70000.0      70.0
7  68000.0      68.0
8  47000.0      47.0
9  60000.0      60.0


 First names
0      navya
1      moksh
2    tamanna
3    anshika
4      rishu
5      nitin
6    sugandh
7        uma
8      surya
9      swati
Name: first_name, dtype: object


 New column: first_name_upper
  first_name first_name_upper
0      navya            NAVYA
1      moksh            MOKSH
2    tamanna          TAMANNA
3    anshika          ANSHIKA
4      rishu            RISHU
5      nitin            NITIN
6    sugandh          SUGANDH
7        uma              UMA
8      surya            SURYA
9      swati            SWATI


New column: city_length
        city  city_length
0   Bareilly            8
1    Bharuch            7
2      Noida            5
3    Lucknow            7
4      bihar            5
5  Chandausi            9
6    gurgoan            7
7      surat            5
8     kanpur            6
9      delhi            5


Using iloc examples
First row (df.iloc[0]):
id                         1
first_name             navya
last_name            agarwal
age                     19.0
salary               50000.0
city                Bareilly
department                HR
age_plus_5              24.0
salary_k                50.0
first_name_upper       NAVYA
city_length                8
Name: 0, dtype: object


First 3 rows (df.iloc[0:3]):
   id first_name last_name   age   salary      city   department  age_plus_5  \
0   1      navya   agarwal  19.0  50000.0  Bareilly           HR        24.0
1   2      moksh     bhatt  18.0  62000.0   Bharuch  Engineering        23.0
2   3    tamanna     gupta   NaN  58000.0     Noida    Marketing         NaN

   salary_k first_name_upper  city_length
0      50.0            NAVYA            8
1      62.0            MOKSH            7
2      58.0          TAMANNA            5


First row, first column (df.iloc[0, 0]):
1


First 5 rows, first 2 columns (df.iloc[0:5, 0:2]):
   id first_name
0   1      navya
1   2      moksh
2   3    tamanna
3   4    anshika
4   5      rishu


All rows, second column (df.iloc[:, 1]):
0      navya
1      moksh
2    tamanna
3    anshika
4      rishu
5      nitin
6    sugandh
7        uma
8      surya
9      swati
Name: first_name, dtype: object


Last row (df.iloc[-1]):
id                        10
first_name             swati
last_name           chaudary
age                     37.0
salary               60000.0
city                   delhi
department           Finance
age_plus_5              42.0
salary_k                60.0
first_name_upper       SWATI
city_length                5
Name: 9, dtype: object


=== Check for null values in each column ===
id                  0
first_name          0
last_name           0
age                 2
salary              1
city                0
department          0
age_plus_5          2
salary_k            1
first_name_upper    0
city_length         0
dtype: int64


Mean age (ignoring NaN): 32.875
 Age and age_filled columns
    age  age_filled
0  19.0      19.000
1  18.0      18.000
2   NaN      32.875
3  19.0      19.000
4  23.0      23.000
5  43.0      43.000
6  40.0      40.000
7  64.0      64.000
8   NaN      32.875
9  37.0      37.000


 Salary and salary_filled columns
    salary  salary_filled
0  50000.0        50000.0
1  62000.0        62000.0
2  58000.0        58000.0
3      NaN            0.0
4  54000.0        54000.0
5  30000.0        30000.0
6  70000.0        70000.0
7  68000.0        68000.0
8  47000.0        47000.0
9  60000.0        60000.0


 DataFrame after dropping 'city_length' column
   id first_name last_name   age   salary      city   department  age_plus_5  \
0   1      navya   agarwal  19.0  50000.0  Bareilly           HR        24.0
1   2      moksh     bhatt  18.0  62000.0   Bharuch  Engineering        23.0
2   3    tamanna     gupta   NaN  58000.0     Noida    Marketing         NaN
3   4    anshika   agarwal  19.0      NaN   Lucknow      Finance        24.0
4   5      rishu    prakas  23.0  54000.0     bihar  Engineering        28.0

   salary_k first_name_upper  age_filled  salary_filled
0      50.0            NAVYA      19.000        50000.0
1      62.0            MOKSH      18.000        62000.0
2      58.0          TAMANNA      32.875        58000.0
3       NaN          ANSHIKA      19.000            0.0
4      54.0            RISHU      23.000        54000.0


 DataFrame after dropping row with index 0
   id first_name last_name   age   salary       city   department  age_plus_5  \
1   2      moksh     bhatt  18.0  62000.0    Bharuch  Engineering        23.0
2   3    tamanna     gupta   NaN  58000.0      Noida    Marketing         NaN
3   4    anshika   agarwal  19.0      NaN    Lucknow      Finance        24.0
4   5      rishu    prakas  23.0  54000.0      bihar  Engineering        28.0
5   6      nitin   agarwal  43.0  30000.0  Chandausi       Intern        48.0

   salary_k first_name_upper  city_length  age_filled  salary_filled
1      62.0            MOKSH            7      18.000        62000.0
2      58.0          TAMANNA            5      32.875        58000.0
3       NaN          ANSHIKA            7      19.000            0.0
4      54.0            RISHU            5      23.000        54000.0
5      30.0            NITIN            9      43.000        30000.0


=== Rows where first_name starts with 'A' ===
Empty DataFrame
Columns: [id, first_name, last_name, age, salary, city, department, age_plus_5, salary_k, first_name_upper, city_length, age_filled, salary_filled]
Index: []


=== Rows where first_name starts with 'J' ===
Empty DataFrame
Columns: [id, first_name, last_name, age, salary, city, department, age_plus_5, salary_k, first_name_upper, city_length, age_filled, salary_filled]
Index: []


=== New column: full_name ===
  first_name last_name        full_name
0      navya   agarwal    navya agarwal
1      moksh     bhatt      moksh bhatt
2    tamanna     gupta    tamanna gupta
3    anshika   agarwal  anshika agarwal
4      rishu    prakas     rishu prakas
5      nitin   agarwal    nitin agarwal
6    sugandh      goel     sugandh goel
7        uma      goel         uma goel
8      surya   prakash    surya prakash
9      swati  chaudary   swati chaudary


=== New column: city_department ===
        city   department        city_department
0   Bareilly           HR          Bareilly - HR
1    Bharuch  Engineering  Bharuch - Engineering
2      Noida    Marketing      Noida - Marketing
3    Lucknow      Finance      Lucknow - Finance
4      bihar  Engineering    bihar - Engineering
5  Chandausi       Intern     Chandausi - Intern
6    gurgoan           HR           gurgoan - HR
7      surat   Operations     surat - Operations
8     kanpur    Marketing     kanpur - Marketing
9      delhi      Finance        delhi - Finance


=== Final DataFrame with new columns ===
   id first_name last_name   age   salary      city   department  age_plus_5  \
0   1      navya   agarwal  19.0  50000.0  Bareilly           HR        24.0
1   2      moksh     bhatt  18.0  62000.0   Bharuch  Engineering        23.0
2   3    tamanna     gupta   NaN  58000.0     Noida    Marketing         NaN
3   4    anshika   agarwal  19.0      NaN   Lucknow      Finance        24.0
4   5      rishu    prakas  23.0  54000.0     bihar  Engineering        28.0

   salary_k first_name_upper  city_length  age_filled  salary_filled  \
0      50.0            NAVYA            8      19.000        50000.0
1      62.0            MOKSH            7      18.000        62000.0
2      58.0          TAMANNA            5      32.875        58000.0
3       NaN          ANSHIKA            7      19.000            0.0
4      54.0            RISHU            5      23.000        54000.0

         full_name        city_department
0    navya agarwal          Bareilly - HR
1      moksh bhatt  Bharuch - Engineering
2    tamanna gupta      Noida - Marketing
3  anshika agarwal      Lucknow - Finance
4     rishu prakas    bihar - Engineering